app/controllers/infos_controller.rb

SELECT "infos".* FROM "infos"
---
  def index
    @infos = Info.all

INSERT INTO "infos" ("name", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "henry"], ["uid", 198744], ["created_at", "2018-11-26 10:40:20.436179"], ["updated_at", "2018-11-26 10:40:20.436179"]]
---
  def create
    @info = Info.new(info_params)

    respond_to do |format|
      if @info.save

SELECT  "infos".* FROM "infos" WHERE "infos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_info
      @info = Info.find(params[:id])